app/Models/Node.php

    public function getConfiguration(): array
    {
        return [
            'debug' => false,
            'token' => Container::getInstance()->make(Encrypter::class)->decrypt($this->daemon_token),
            'api' => [
                'host' => '0.0.0.0',
                'port' => $this->daemonListen,
                'ssl' => [
                    'enabled' => (!$this->behind_proxy && $this->scheme === 'https'),
                    'cert' => '/etc/letsencrypt/live/' . Str::lower($this->fqdn) . '/fullchain.pem',
                    'key' => '/etc/letsencrypt/live/' . Str::lower($this->fqdn) . '/privkey.pem',
                ],
                'upload_limit' => $this->upload_size,
            ],
            'system' => [
                'data' => $this->daemonBase,
                'sftp' => [
                    'bind_port' => $this->daemonSFTP,
                ],
            ],
            'allowed_mounts' => $this->mounts->pluck('source')->toArray(),
            'remote' => route('index'),
            'suptoken' => '',
        ];
---
SELECT `mounts`.*, `mount_node`.`node_id` as `laravel_through_key` FROM `mounts` inner join `mount_node` on `mount_node`.`mount_id` = `mounts`.`id` WHERE `mount_node`.`node_id` = 1